---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TooManyElementsToCheckout
source: html/3a11aaf5-d512-bdd6-a1ab-cdc236887556.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TooManyElementsToCheckout Property

Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyElementsToCheckout { get; }
```